#+title: Sprint Backlog 26
#+options: date:nil toc:nil author:nil num:nil
#+todo: STARTED | COMPLETED CANCELLED POSTPONED
#+tags: { story(s) epic(e) spike(p) }

* Sprint Goals

- finish PMM generation.
- implement locator and dependencies via PMM.
- move physical elements and transforms from logical and text models
  to physical model.

* Stories

** Active

#+begin: clocktable :maxlevel 3 :scope subtree :indent nil :emphasize nil :scope file :narrow 75 :formula %
#+CAPTION: Clock summary at [2020-06-03 Wed 22:00]
| <75>                                               |        |      |      |       |
| Headline                                           | Time   |      |      |     % |
|----------------------------------------------------+--------+------+------+-------|
| *Total time*                                       | *7:28* |      |      | 100.0 |
|----------------------------------------------------+--------+------+------+-------|
| Stories                                            | 7:28   |      |      | 100.0 |
| Active                                             |        | 7:28 |      | 100.0 |
| Edit release notes for previous sprint             |        |      | 6:57 |  93.1 |
| Create a demo and presentation for previous sprint |        |      | 0:25 |   5.6 |
| Sprint and product backlog grooming                |        |      | 0:06 |   1.3 |
#+TBLFM: $5='(org-clock-time%-mod @3$2 $2..$4);%.1f
#+end:

*** COMPLETED Edit release notes for previous sprint                  :story:
    CLOSED: [2020-06-03 Wed 21:35]
    :LOGBOOK:
    CLOCK: [2020-06-03 Wed 21:12]--[2020-06-03 Wed 21:34] =>  0:22
    CLOCK: [2020-06-02 Tue 23:47]--[2020-06-02 Tue 23:55] =>  0:08
    CLOCK: [2020-06-02 Tue 21:37]--[2020-06-02 Tue 23:39] =>  2:02
    CLOCK: [2020-06-02 Tue 21:06]--[2020-06-02 Tue 21:36] =>  0:30
    CLOCK: [2020-06-02 Tue 19:35]--[2020-06-02 Tue 20:56] =>  1:21
    CLOCK: [2020-06-01 Mon 20:01]--[2020-06-01 Mon 22:35] =>  2:34
    :END:

Add github release notes for previous sprint.

*** STARTED Create a demo and presentation for previous sprint        :story:
    :LOGBOOK:
    CLOCK: [2020-06-03 Wed 21:35]--[2020-06-03 Wed 22:00] =>  0:25
    :END:

Time spent creating the demo and presentation.

**** Presentation

(defvar org-present-text-scale 6)

***** Dogen v1.0.25, "Foz do Cunene"

    Marco Craveiro
    Domain Driven Development
    Released on 31st June 2020

***** Profiles do not support collection types

    - add support for text collections
    - add support for KVPs

***** Extend tracing to M2T transforms

    - updates to stitch templates:

    #+begin_src c++
void backend_class_header_transform::apply(const context& ctx, const logical::entities::element& e,
    physical::entities::artefact& a) const {
    tracing::scoped_transform_tracer stp(lg, "backend class header transform",
        transform_id, e.name().qualified().dot(), *ctx.tracer(), e);
    assistant ast(ctx, e, archetype().meta_name(), true/*requires_header_guard*/, a);
    #+end_src

    - demonstrate the new tracing files

***** Add "scoped tracing" via regexes

    - regenerate tracing with regex.

***** Handling of container names is incorrect

    - show files in github from previous release.

***** Update stitch mode for emacs

    - show stitch mode in emacs.

***** Create archetypes for all physical elements

    - show =text.cpp= model.

***** Discuss internal stories

    - update formatters to M2T transforms.
    - generate PMM.

*** STARTED Sprint and product backlog grooming                       :story:
    :LOGBOOK:
    CLOCK: [2020-06-02 Tue 23:40]--[2020-06-02 Tue 23:46] =>  0:06
    :END:

Updates to sprint and product backlog.

*** Nightly nursing                                                   :story:

Time spent fixing issues with nightly builds, daily checks etc.

** Deprecated
